using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WPF_BUNKER.GameGeneration
{
    public class GameGenerator
    {
        private int N;
        public string Bunker;
        public string Cataclysm;

        //Генерація нової гри
        public GameGenerator(int N)
        {
            this.N = N;
            Bunker = GenerateBunker();
            Cataclysm = GenerateCataclysm();
        }

        //Генерація псевдорандомного бункера з масиву
        public string GenerateBunker()
        {
            Random random = new Random();
            string[] bunkers = new string[]
{
    $@"Бункер знаходиться на вершині Говерли, всередині поміщаються {N} людей середньої статури до 183см зростом, бункер містить в собі прилади домедичної допомоги та 12 револьверів, стала температура всередині 7 градусів",

    $@"Бункер колишнього пісочного кар'єру. Місткість - {N} гравців. Ховає у собі маніпуляційну, неробочу кухню, кімнату для електрофорезу, міні-бібліотеку. Вхідні двері сильно клинить. Всюди гори піску та пилу, проте у цьому піску підтверджено добре росте бульба.",

    $@"Бункер на віддаленому архіпелазі у Індійському океані. Побудований для політичної еліти сусідньої наддержави, закладений на глибині 100 м. Порушена система вентиляції у головному корпусі. Може прийняти до {N} осіб.",

    $@"Бункер у самому серці Німеччині. Схоже,що це бункер усім відомого художника. Хоча побудований у 30х роках минулого століття - зберігся в гарному стані, проте каналізаційна система не пройшла перевірку часом та частина меблів розвалюється від одного погляду. Містить достатній запас їжі для {N} осіб, якої стане на 3 роки.",

    $@"Бункер: великий (має достатньо простору для {N} гравців), занедбаний, але має дуже велику систему ходів. 3 вихода знаходяться у Житомирі, під церквою. Бункер має свою теплицю і ферму, а також власний оберіг, що на думку давніх Житомирян приносить удачу та спасіння.",

    $@"Вам пощастило опинитись в укритті радіо-технічного факультету одного з університетів. Бункер збудований з особливого матеріалу, що захищає від електромагнітних бурь та інших радіаційних небезпек. Усередині бункера спеціальні магнітні бар'єри захищають електроніку від знищення. Технічно оснащений, як пункт зв'язку, передача інформації можлива у будь-яку точку світу. Містить великий запас пороху та жита. Вміщає до {N} осіб.",

    $@"Бункер знаходиться на Троєщині, у підвалі колишнього гуртожитку. Тут є пакетики розсади різноманітних трав, туалетний папір з часів пандемії COVID-19, ковбаса з 17 століття, та розбите вікно. Є вода бо він затоплений. Усередині може знаходитись до {N} гравців.",

    $@"Бункер знаходиться на околиці індустріального міста-мільйонника, у підвалі приватного будинку. Ваша вдача не зрадила вас -- родина покинула помешкання. На вході лежить записка: ""щоб дістатись до їжі - треба пройти квест"". З неї точно відомо, що питання пов'язані з дисципліною ""Математичний аналіз"", знанням породи домашніх хом'яків та фізичної географії Швейцарії. Приміщення, що знаходиться перед вами, може вмістити до {N} осіб. Чи є щось за дверима з ""квестом"" -- невідомо.",

    $@"Перед вами серверне приміщення коллцентру колишнього бандита на прізвисько ""Зайка"". Розташоване у глибокому підвалі, що у 2022 році Кличко сертифікував, як укриття. Тому у ньому є електрика, справна вентиляція, барабанна установка, але нема зв'язку та вхідні двері зачинені. Більшість простору займають несправні сервери, тому бункер вміщає тільки {N-1} осіб.",

    $@"Центр Житомира, стан нестабільний. У кімнатах відбуваються ""аномалії"", зникають речі. Є заблокована зброярня та кухня. Запас води на рік, їжа зникла під впливом ""аномалій"". Розрахований на проживання {N} людей, упродовж 2 років.",

    $@"Справжня перлина у Чорного моря - вас занесло у Севастополь! Ховатися вам доведеться у колишніх катакомбах для зберігання ядерного арсеналу СРСР. Звідси стара, проте надійна система захисту бункеру від зовнішнього впливу, справна вентиляція та каналізація, а також тони тушенки. Доступна вам секція вмістить до {N} осіб.
    Але не все так просто, цей бункер був експериментом радянських інженерів. Він може піднятися на водній підкладці, перетворюючись на плаваючий острів в разі надзвичайної ситуації, наприклад, повені або землетрусу.",


    $@"Вам пощастило! Ваша група опинилась біля одного з входів у Метроград - підземний торговельний центр у серці столиці. Проте, не все так райдужно. Доступна вам секція містить достатньо ресурсів лише для {N} гравців. Довкола вас знаходяться магазин з вишиванками, кав'ярня та колонія крис у сусідній секції. Вентиляцію пошкоджено. Мапу торговельного центру — знищено."
};
            string bunker = bunkers[random.Next(bunkers.Length)];

            return bunker;
        }

        //Генерація псевдорандомного катаклізму з масиву
        public string GenerateCataclysm()
        {
            Random random = new Random();
            string[] cataclysmNames = { @"Сталося те, чого боялися усі наші батьки, а ще більше бабці під під'їздом: всі стали діджитал номадами, звичайні професії як фермер, скотар, кухар - щезли. 
    У результаті, через велике навантаження, стається нестача Інтернету у світі. Люди почали сходити з розуму. Розпочалась війна за ресурси. При чому що за віртуальні, що за фізичні, а причиною цьому є систематичний брак робітничих професій.
    Неминучим плюсом буде зібрати команду, що ще не забула, як це — працювати руками, а не клавішами, та перечекати наступні 2 роки подалі від червоноокого мракобєсія айтішників.
    Нехай виживуть і відродяться найзаземленіші!🌱",

    @"Догралися! 
    Експерименти людства з новітнім озброєнням закінчилися неочікуваним витоком біозброї. Хто ж знав, що вона справді існує? Та і якщо ви її розроблюєте, хіба ви паритесь над антидотом? 
    Найгірше, що матеріали, які опинились на поверхні, спричиняють раптове згортання крові, а потім і смерть, у межах 3 хвилин після респіраторного контакту. Респіратори та протигази вас не врятують, сховатися можна тільки під землею, маючи справну систему очистки повітря. 
    Дихайте на дотик, і удачі найсправнішим гравцям відшукати антидот! Пам'ятайте — ви ще потрібні людству!",

    @"Більше не питатимеш у баби, нащо стільки часнику у льосі — тепер він твій найліпший друг. 
    Всесвіт став схожим на мрію графа Влада Дракули — вампіри всюди! Мотивація білолицих неясна, але їх все більшає, а доля обіду може спіткати кожного з нас. Румунські шаблезубики бояться хіба славнозвісного часнику і срібла. Сонце і осина їх чомусь не лякають, скарги про дизінформацію можете лишати на гарячій лінії 'скарги та пропозиції до народних переказів'.
    А поки не гайте часу і обирайте, кого ховатимете до кращих часів, а кому не пощастить доживати життя поза бункером.",

    @"Далеко сховали маски? Та ні, можете не діставати, на цей раз не допоможе.
    Планетою стрімко шириться новий вірус HT-67. Зараження відбувається через повітряні шляхи та ураження водойм з питною водою. Вірус не вбивається ні кип'ятінням, ні хлорування, ні іншими відомими способами очистки води.
    Після 30 хвилин з моменту контакту з ураженою територію, вірус досягає головного мозку, ще за 15 наступає смерть. Антидоту не існує, усі дослідники вірусу неминуче нас покидають. 
    Проте ходять чутки, що люди з хронічними захворюваннями респіраторних органів — одужують упродовж трьох діб. Можливо, у цьому криється ключ до виживання?
    Чи це чергова справа китайців чи ні, але розгрібати нам це доведеться. А поки найкращим з нас варто зберегти себе у глибинах Землі.
    Не покидайте надій побороти заразу!",

    @"Людство захопили прибульці, яким подобається дивитись на страждання інших істот. Але їхні розуміння тортур є особливими — прибульці примушують людей до надактивної мозкової діяльності, напрацювання якої використовують у своїх колонізаторських цілях.
    Нам стало відомо, що їхня рідна планета має набагато вищі температуру ядра та мантії, але міцна кора, товщиною всього у 2 - 3км, з невідомого нам матеріалу забезпечує схожі з земними температури. Через це, загарбники поки не здогадались шукати залишки людей глибше стандартного підвалу будинку. 
    Проте, 'качаннями' інформації з людей, вони дуже скоро можуть змінити ситуацію на свою користь.
    Звідкілясь вам стало відомо, що, окрім високих температур та прямого вогню, прибульці панічно бояться консервованих огірків.
    Удачі найсильнішим сміливцям вижити та подолати іноземну нечисть!" };
            string cataclysm = cataclysmNames[random.Next(cataclysmNames.Length)];

            return cataclysm;
        }
    }
}
